-----------------------------------------------------------------------------
  Layer (type)        Input Shape          Output Shape         Param #    
=============================================================================
    Conv2D-15      [[1, 3, 256, 256]]   [1, 32, 256, 256]        7,808     
 BatchNorm2D-16   [[1, 32, 256, 256]]   [1, 32, 256, 256]         128      
    Conv2D-16     [[1, 32, 256, 256]]   [1, 64, 128, 128]       32,832     
 BatchNorm2D-17   [[1, 64, 128, 128]]   [1, 64, 128, 128]         256      
    Conv2D-17     [[1, 64, 128, 128]]    [1, 128, 64, 64]       131,200    
 BatchNorm2D-18    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
    Conv2D-18      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-19    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
     ReLU-6        [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-19      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-20    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
  BasicBlock-6     [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-20      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-21    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
     ReLU-7        [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-21      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-22    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
  BasicBlock-7     [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-22      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-23    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
     ReLU-8        [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-23      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-24    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
  BasicBlock-8     [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-24      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-25    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
     ReLU-9        [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-25      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-26    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
  BasicBlock-9     [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-26      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-27    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
     ReLU-10       [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
    Conv2D-27      [[1, 128, 64, 64]]    [1, 128, 64, 64]       147,456    
 BatchNorm2D-28    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
  BasicBlock-10    [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
Conv2DTranspose-4  [[1, 128, 64, 64]]   [1, 64, 129, 129]       131,136    
 BatchNorm2D-29   [[1, 64, 129, 129]]   [1, 64, 129, 129]         256      
Conv2DTranspose-5 [[1, 64, 129, 129]]   [1, 32, 257, 257]       32,800     
 BatchNorm2D-30   [[1, 32, 257, 257]]   [1, 32, 257, 257]         128      
Conv2DTranspose-6 [[1, 32, 257, 257]]   [1, 32, 257, 257]       82,976     
    Conv2D-28     [[1, 32, 257, 257]]    [1, 1, 256, 256]         129      
=============================================================================
Total params: 1,899,841
Trainable params: 1,893,441
Non-trainable params: 6,400
-----------------------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 241.13
Params size (MB): 7.25
Estimated Total Size (MB): 249.12
-----------------------------------------------------------------------------

{'total_params': 1899841, 'trainable_params': 1893441}