------------------------------------------------------------------------------
   Layer (type)        Input Shape          Output Shape         Param #    
==============================================================================
    Conv2D-29       [[1, 3, 256, 256]]   [1, 32, 128, 128]         896      
  BatchNorm2D-31   [[1, 32, 128, 128]]   [1, 32, 128, 128]         128      
     ReLU-11       [[1, 32, 128, 128]]   [1, 32, 128, 128]          0       
     ReLU-12       [[1, 32, 128, 128]]   [1, 32, 128, 128]          0       
SeparableConv2D-1  [[1, 32, 128, 128]]   [1, 64, 128, 128]        2,400     
  BatchNorm2D-32   [[1, 64, 128, 128]]   [1, 64, 128, 128]         256      
     ReLU-13       [[1, 64, 128, 128]]   [1, 64, 128, 128]          0       
SeparableConv2D-2  [[1, 64, 128, 128]]   [1, 64, 128, 128]        4,736     
  BatchNorm2D-33   [[1, 64, 128, 128]]   [1, 64, 128, 128]         256      
   MaxPool2D-1     [[1, 64, 128, 128]]    [1, 64, 64, 64]           0       
    Conv2D-30      [[1, 32, 128, 128]]    [1, 64, 64, 64]         2,112     
    Encoder-1      [[1, 32, 128, 128]]    [1, 64, 64, 64]           0       
     ReLU-14        [[1, 64, 64, 64]]     [1, 64, 64, 64]           0       
SeparableConv2D-3   [[1, 64, 64, 64]]     [1, 128, 64, 64]        8,896     
  BatchNorm2D-34    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
     ReLU-15        [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
SeparableConv2D-4   [[1, 128, 64, 64]]    [1, 128, 64, 64]       17,664     
  BatchNorm2D-35    [[1, 128, 64, 64]]    [1, 128, 64, 64]         512      
   MaxPool2D-2      [[1, 128, 64, 64]]    [1, 128, 32, 32]          0       
    Conv2D-31       [[1, 64, 64, 64]]     [1, 128, 32, 32]        8,320     
    Encoder-2       [[1, 64, 64, 64]]     [1, 128, 32, 32]          0       
     ReLU-16        [[1, 128, 32, 32]]    [1, 128, 32, 32]          0       
SeparableConv2D-5   [[1, 128, 32, 32]]    [1, 256, 32, 32]       34,176     
  BatchNorm2D-36    [[1, 256, 32, 32]]    [1, 256, 32, 32]        1,024     
     ReLU-17        [[1, 256, 32, 32]]    [1, 256, 32, 32]          0       
SeparableConv2D-6   [[1, 256, 32, 32]]    [1, 256, 32, 32]       68,096     
  BatchNorm2D-37    [[1, 256, 32, 32]]    [1, 256, 32, 32]        1,024     
   MaxPool2D-3      [[1, 256, 32, 32]]    [1, 256, 16, 16]          0       
    Conv2D-32       [[1, 128, 32, 32]]    [1, 256, 16, 16]       33,024     
    Encoder-3       [[1, 128, 32, 32]]    [1, 256, 16, 16]          0       
     ReLU-18        [[1, 256, 16, 16]]    [1, 256, 16, 16]          0       
Conv2DTranspose-7   [[1, 256, 16, 16]]    [1, 256, 16, 16]       590,080    
  BatchNorm2D-38    [[1, 256, 16, 16]]    [1, 256, 16, 16]        1,024     
     ReLU-19        [[1, 256, 16, 16]]    [1, 256, 16, 16]          0       
Conv2DTranspose-8   [[1, 256, 16, 16]]    [1, 256, 16, 16]       590,080    
  BatchNorm2D-39    [[1, 256, 16, 16]]    [1, 256, 16, 16]        1,024     
    Upsample-1      [[1, 256, 16, 16]]    [1, 256, 32, 32]          0       
    Upsample-2      [[1, 256, 16, 16]]    [1, 256, 32, 32]          0       
    Conv2D-33       [[1, 256, 32, 32]]    [1, 256, 32, 32]       65,792     
    Decoder-1       [[1, 256, 16, 16]]    [1, 256, 32, 32]          0       
     ReLU-20        [[1, 256, 32, 32]]    [1, 256, 32, 32]          0       
Conv2DTranspose-9   [[1, 256, 32, 32]]    [1, 128, 32, 32]       295,040    
  BatchNorm2D-40    [[1, 128, 32, 32]]    [1, 128, 32, 32]         512      
     ReLU-21        [[1, 128, 32, 32]]    [1, 128, 32, 32]          0       
Conv2DTranspose-10  [[1, 128, 32, 32]]    [1, 128, 32, 32]       147,584    
  BatchNorm2D-41    [[1, 128, 32, 32]]    [1, 128, 32, 32]         512      
    Upsample-3      [[1, 128, 32, 32]]    [1, 128, 64, 64]          0       
    Upsample-4      [[1, 256, 32, 32]]    [1, 256, 64, 64]          0       
    Conv2D-34       [[1, 256, 64, 64]]    [1, 128, 64, 64]       32,896     
    Decoder-2       [[1, 256, 32, 32]]    [1, 128, 64, 64]          0       
     ReLU-22        [[1, 128, 64, 64]]    [1, 128, 64, 64]          0       
Conv2DTranspose-11  [[1, 128, 64, 64]]    [1, 64, 64, 64]        73,792     
  BatchNorm2D-42    [[1, 64, 64, 64]]     [1, 64, 64, 64]          256      
     ReLU-23        [[1, 64, 64, 64]]     [1, 64, 64, 64]           0       
Conv2DTranspose-12  [[1, 64, 64, 64]]     [1, 64, 64, 64]        36,928     
  BatchNorm2D-43    [[1, 64, 64, 64]]     [1, 64, 64, 64]          256      
    Upsample-5      [[1, 64, 64, 64]]    [1, 64, 128, 128]          0       
    Upsample-6      [[1, 128, 64, 64]]   [1, 128, 128, 128]         0       
    Conv2D-35      [[1, 128, 128, 128]]  [1, 64, 128, 128]        8,256     
    Decoder-3       [[1, 128, 64, 64]]   [1, 64, 128, 128]          0       
     ReLU-24       [[1, 64, 128, 128]]   [1, 64, 128, 128]          0       
Conv2DTranspose-13 [[1, 64, 128, 128]]   [1, 32, 128, 128]       18,464     
  BatchNorm2D-44   [[1, 32, 128, 128]]   [1, 32, 128, 128]         128      
     ReLU-25       [[1, 32, 128, 128]]   [1, 32, 128, 128]          0       
Conv2DTranspose-14 [[1, 32, 128, 128]]   [1, 32, 128, 128]        9,248     
  BatchNorm2D-45   [[1, 32, 128, 128]]   [1, 32, 128, 128]         128      
    Upsample-7     [[1, 32, 128, 128]]   [1, 32, 256, 256]          0       
    Upsample-8     [[1, 64, 128, 128]]   [1, 64, 256, 256]          0       
    Conv2D-36      [[1, 64, 256, 256]]   [1, 32, 256, 256]        2,080     
    Decoder-4      [[1, 64, 128, 128]]   [1, 32, 256, 256]          0       
    Conv2D-37      [[1, 32, 256, 256]]    [1, 3, 256, 256]         867      
==============================================================================
Total params: 2,058,979
Trainable params: 2,051,427
Non-trainable params: 7,552
------------------------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 301.00
Params size (MB): 7.85
Estimated Total Size (MB): 309.60
------------------------------------------------------------------------------

{'total_params': 2058979, 'trainable_params': 2051427}